<template>
  <v-app class="new_font">
    <NavigationBar />
    <v-main>
      <div class="bgimg">
        <v-container class="text-justify">
          <v-row justify="space-between">
            <v-col cols="12" md="5" class="text-white">
              <h1 class="text-center">Гармония с вегетососудистой дистонией</h1>
              <p class="my-5 paragraph">
                Вегето-сосудистая дистония может повлиять на качество жизни,
                вызывая различные симптомы, включая головокружение,
                сердцебиение, изменения артериального давления, усталость и
                тревожность. Но есть хорошие новости! Путем скорректированного
                образа жизни и управления факторами, которые влияют на ВСД, вы
                можете улучшить свое состояние и восстановить контроль над своим
                здоровьем.
              </p>
            </v-col>
            <v-col cols="12" md="6">
              <v-card class="py-6 px-6">
                <NotificationsComponents />
              </v-card>
            </v-col>
          </v-row>
        </v-container>
      </div>
      <v-divider :thickness="3" />

      <v-container class="my-8">
        <v-expansion-panels class="mb-6" multiple>
          <v-expansion-panel>
            <v-expansion-panel-title>
              <h2>Что такое Вегетососудистая дистония</h2>
            </v-expansion-panel-title>
            <v-expansion-panel-text
              ><p class="paragraph">
                Вегетососудистая дистония (ВСД) представляет собой нарушение
                тонуса кровеносных сосудов, таких как артерии, вены и капилляры,
                вызванное дисбалансом в работе вегетативной нервной системы.
                Нервная система человека состоит из соматической нервной системы
                и вегетативной нервной системы. ВСД связана с нарушением работы
                вегетативной нервной системы и возникает из-за нарушения баланса
                между ее двумя компонентами - симпатической и парасимпатической
                системами. Симпатическая нервная система регулирует активность
                внутренних органов и активизирует процессы, связанные с
                энергозатратами. Парасимпатическая система, напротив,
                активизирует процессы накопления энергии и веществ в организме.
                Нарушение баланса между этими системами может привести к
                развитию синдрома ВСД.
              </p>
            </v-expansion-panel-text>
          </v-expansion-panel>
          <v-expansion-panel>
            <v-expansion-panel-title>
              <h2>Причины возникновения</h2>
            </v-expansion-panel-title>
            <v-expansion-panel-text>
              <h3>Наследственные и конституциональные факторы</h3>
              <p class="ma-3 paragraph">
                Наследственность и конституциональные факторы играют важную роль
                в развитии ВСД. У детей с конституциональным синдромом ВСД могут
                проявляться различные симптомы, такие как неустойчивость
                вегетативных параметров, изменение окраски кожи, повышенная
                потливость, колебания пульса и артериального давления, а также
                проблемы с желудочно-кишечным трактом, склонность к
                субфебрилитету, метеочувствительность и непереносимость
                физической и умственной нагрузки. Это связано с нарушением
                регуляции сосудистого тонуса высших сосудодвигательных центров и
                функций центральной и вегетативной нервной системы. Отмечается,
                что у разных людей реакция на стресс и склонность к развитию ВСД
                может различаться. Это зависит от особенностей высшей нервной
                деятельности, ранимости, эмоциональной устойчивости и
                физического состояния в момент стресса. Некоторые люди тяжело
                заболевают при стрессовых ситуациях, в то время как другие
                сохраняют здоровье, и это связано с конституцией и
                наследственностью. Люди с сильной нервной системой обычно лучше
                переносят эмоциональные и физические нагрузки, в то время как
                люди с слабой нервной системой более подвержены расстройствам
                даже при небольших нагрузках. У тех, у кого есть генетически
                обусловленная особенность нервной деятельности, защитные
                механизмы более устойчивы, что помогает им адаптироваться к
                стрессу и предотвращает развитие ВСД.
              </p>
              <h3>Эндокринные перестройки</h3>
              <p class="ma-3 paragraph">
                Также эндокринные перестройки, особенно в период полового
                созревания, могут вызывать вегетативные нарушения у подростков.
                Дети и подростки с ВСД гипотонического типа часто страдают
                обмороками в закрытых и переполненных помещениях из-за быстрого
                роста организма, когда сердечно-сосудистая система не успевает
                обеспечить его питанием. В переходном возрасте могут возникать
                перепады давления, эмоциональная неустойчивость, приливы жара и
                потливость, которые также могут быть проявлениями ВСД. При
                развитии ВСД у детей и подростков также играют роль
                наследственность, несоблюдение режима дня, конфликтные ситуации
                в школе и дома, а также перенесенные инфекционные заболевания.
                Врачи обращают внимание на ВСД у детей и подростков из-за
                эмоциональных и умственных перегрузок, с которыми они
                сталкиваются в современных условиях жизни, особенно во время
                учебы. Девушки часто подвержены обморокам, особенно в
                критические дни и во время беременности, из-за падения
                артериального давления.
              </p>
              <h3>Стресс и невроз</h3>
              <p class="ma-3 paragraph">
                Стресс является значительным фактором развития ВСД. Отсутствие
                отдыха, недосыпание и неблагоприятные условия на работе и дома
                также влияют на сосудистую регуляцию. Однократное сильное
                нервное потрясение может вызвать функциональные расстройства
                нервной системы, а продолжительное воздействие стресса и
                неблагоприятной среды может привести к серьезным заболеваниям,
                включая гипертоническую болезнь. Регулярный отдых, нормальный
                сон и разумная физическая активность способствуют восстановлению
                и улучшению состояния пациентов с ВСД. Отрицательные эмоции,
                такие как гнев, обида, досада и тревога, оказывают
                неблагоприятное влияние на нервную систему и могут привести к
                развитию стойкого невроза. Люди, страдающие неврозом, сильно и
                остро реагируют на неблагоприятные ситуации или обиды и могут
                застрять в негативных переживаниях. Течение невроза усугубляется
                продолжительностью переживания. При неврозе нарушается баланс
                возбуждения и торможения в коре головного мозга, что приводит к
                неправильной регуляции сосудистой системы. Стресс чаще всего
                вызывает ВСД гипертонического типа, связанного с усилением
                активности симпатической нервной системы. ВСД гипотонического
                типа может развиваться при неврозах с усилением функции
                парасимпатической системы. Отрицательные эмоции и стресс
                вызывают сильное возбуждение симпатической нервной системы, а
                усиленная функция парасимпатической системы приводит к
                релаксации и увеличению количества инсулина в крови. Эти
                механизмы объясняют разницу в симптомах гипертензивного и
                гипотензивного типов ВСД. Оба типа ВСД связаны с нарушением
                нервной регуляции.
              </p>
              <h3>Курение и алкоголь</h3>
              <p class="ma-3 paragraph">
                Никотин и ядовитые вещества, образующиеся при курении табака,
                оказывают вредное воздействие на сердечно-сосудистую и нервную
                системы. Никотин особенно влияет на кровеносные сосуды и
                вегетативную нервную систему, нарушая кровоснабжение сосудистой
                стенки и повышая ее проницаемость. Это приводит к неправильным
                сосудистым реакциям и изменениям вегетативной нервной регуляции.
                Курение также способствует развитию неврозов и снижению
                выносливости нервной системы. Злоупотребление алкоголем
                повреждает и угнетает центральную нервную систему, нарушает
                обменные процессы в организме и функции внутренних органов.
                Особенно подвержены воздействию алкоголя клетки печени,
                сердечной мышцы и эндокринных желез. Алкоголь также нарушает
                работу нервной системы, обмен веществ и функции сердца и
                сосудов, являясь фактором риска для возникновения ВСД.
              </p>
            </v-expansion-panel-text>
          </v-expansion-panel>
          <v-expansion-panel>
            <v-expansion-panel-title>
              <h2>Симптомы</h2>
            </v-expansion-panel-title>
            <v-expansion-panel-text
              ><p class="ma-3 paragraph">
                Вегетососудистая дистония (ВСД) проявляется через приступы,
                известные как вегетативно-сосудистые пароксизмы или кризы. Эти
                приступы могут начинаться с головной боли или боли в области
                сердца, сопровождаться сердцебиением, покраснением или
                побледнением кожи. Артериальное давление повышается, пульс
                учащается, температура тела возрастает, а также появляется зноб.
                Кроме того, могут возникать беспричинный страх и другие
                симптомы, включая общую слабость, головокружение, потемнение в
                глазах, потливость, тошноту, снижение давления и замедление
                пульса. Продолжительность приступов может варьироваться от
                нескольких минут до 2-3 часов, и у многих людей они могут
                проходить без медицинского вмешательства.
              </p>
              <p class="ma-3 paragraph">
                Во время обострения ВСД, кисти и стопы могут приобретать
                багрово-синюшный цвет, становиться влажными, холодными, с
                появлением бледных пятен и "мраморной" кожи. Также могут
                возникать онемение, покалывание и боли в пальцах. Факторы, такие
                как переутомление, недостаток сна и чувство тревоги, могут
                провоцировать приступы и увеличивать их частоту. После приступа
                человек может ощущать разбитость и общую слабость в течение
                нескольких дней.
              </p>
              <p class="ma-3 paragraph">
                Диагноз ВСД указывает на нарушения в работе самой быстро
                реагирующей и уязвимой системы - сердечно-сосудистой системы. В
                зависимости от типа реакции сердечно-сосудистой системы
                выделяются кардиальный, гипотензивный и гипертензивный типы
                нейроциркуляторной дистонии.
              </p>

              <v-row>
                <v-col cols="12" md="4">
                  <v-card class="pa-2 ma-2" variant="tonal"
                    ><v-card-item
                      ><v-card-title>Кардиальный тип</v-card-title></v-card-item
                    >
                    <v-card-text>
                      характеризуется жалобами на сердцебиение, перебои в работе
                      сердца, ощущение нехватки воздуха и изменения сердечного
                      ритма. В этом типе ВСД происходит избыточное образование
                      катехоламинов и молочной кислоты, что играет большую роль
                      в сердечных симптомах.
                    </v-card-text></v-card
                  >
                </v-col>
                <v-col cols="12" md="4">
                  <v-card class="pa-2 ma-2" variant="tonal"
                    ><v-card-item
                      ><v-card-title
                        >Гипотензивный тип</v-card-title
                      ></v-card-item
                    >
                    <v-card-text>
                      характеризуется снижением систолического давления,
                      утомляемостью, мышечной слабостью, головной болью, бледной
                      кожей, зябкостью и похолоданием конечностей, а также
                      частыми обмороками.
                    </v-card-text></v-card
                  >
                </v-col>
                <v-col cols="12" md="4">
                  <v-card class="pa-2 ma-2" variant="tonal"
                    ><v-card-item
                      ><v-card-title
                        >Гипертензивный тип</v-card-title
                      ></v-card-item
                    >
                    <v-card-text>
                      характеризуется временным повышением артериального
                      давления, которое может не сказываться на самочувствии
                      большинства пациентов, хотя некоторые могут испытывать
                      головную боль, сердцебиение и повышенную утомляемость.
                    </v-card-text></v-card
                  >
                </v-col>
              </v-row>

              <p class="ma-3 paragraph">
                Также возможны смешанные варианты ВСД, в которых объединяются
                симптомы разных типов. Необходимо отметить, что все типы ВСД
                характеризуются общими симптомами, такими как:
              </p>
              <ul class="ma-5 paragraph">
                <li>боли в грудной клетке</li>
                <li>головные боли</li>
                <li>головокружение</li>
                <li>астения</li>
                <li>слабость мышц</li>
                <li>нарушения сна</li>
                <li>небольшое повышение температуры</li>
                <li>аритмия, изменение ритма сердца</li>
                <li>скачки артериального давления</li>
                <li>одышка</li>
                <li>тревожные состояния</li>
                <li>депрессия</li>
                <li>полиурия</li>
                <li>вегетативные кожные расстройства</li>
                <li>метеозависимость</li>
                <li>функциональная дискинезия желудочно-кишечного тракта</li>
              </ul>
            </v-expansion-panel-text>
          </v-expansion-panel>
          <v-expansion-panel>
            <v-expansion-panel-title>
              <h2>Рекомендации, которые помогут справиться с ВСД</h2>
            </v-expansion-panel-title>
            <v-expansion-panel-text>
              <v-expansion-panels class="mb-6" multiple>
                <v-expansion-panel>
                  <v-expansion-panel-title>
                    Регулярное физическое упражнение
                  </v-expansion-panel-title>
                  <v-expansion-panel-text>
                    <ul class="mx-5 my-2">
                      <li class="paragraph">
                        Упражнения средней интенсивности, такие как ходьба,
                        плавание, йога или танцы, могут быть полезны для
                        укрепления сердечно-сосудистой системы.
                      </li>
                      <li class="paragraph">
                        Приступайте к физическим нагрузкам постепенно, избегая
                        резких перегрузок.
                      </li>
                      <li class="paragraph">
                        Регулярные тренировки 20-30 минут в день, 3-5 раз в
                        неделю, могут помочь снизить уровень тревоги и улучшить
                        общую физическую выносливость.
                      </li>
                    </ul>
                  </v-expansion-panel-text>
                </v-expansion-panel>
                <v-expansion-panel>
                  <v-expansion-panel-title>
                    Правильное дыхание
                  </v-expansion-panel-title>
                  <v-expansion-panel-text>
                    <ul class="mx-5 my-2">
                      <li class="paragraph">
                        При ВСД важно обращать внимание на дыхание. Это может
                        помочь снизить симптомы тревоги и головокружения.
                      </li>
                      <li class="paragraph">
                        Глубокое и медленное дыхание помогает снизить активность
                        симпатической нервной системы и снять напряжение.
                      </li>
                      <li class="paragraph">
                        Практикуйте диафрагмальное дыхание, при котором вы
                        дышите глубоко, расширяя живот, а не грудную клетку.
                      </li>
                      <li class="paragraph">
                        При осознанном дыхании задержите вдох на несколько
                        секунд перед плавным выдохом.
                      </li>
                      <li class="paragraph">
                        Это можно делать несколько раз в день или при
                        возникновении симптомов ВСД.
                      </li>
                    </ul>
                  </v-expansion-panel-text>
                </v-expansion-panel>

                <v-expansion-panel>
                  <v-expansion-panel-title>
                    Управление стрессом
                  </v-expansion-panel-title>
                  <v-expansion-panel-text>
                    <ul class="mx-5 my-2">
                      <li class="paragraph">
                        Стресс может усиливать симптомы ВСД. Попробуйте
                        различные методы расслабления, такие как медитация,
                        глубокая мышечная релаксация, массаж или слушание
                        приятной музыки. Найдите способ снизить стресс, который
                        работает лучше всего для вас.
                      </li>
                      <li class="paragraph">
                        Найдите свои способы справляться со стрессом, которые
                        работают лучше всего для вас: это может быть чтение,
                        прогулка на природе, слушание музыки или занятие хобби.
                      </li>
                      <li class="paragraph">
                        Регулярно выделяйте время для себя и отдыха, чтобы
                        восстановить энергию и снизить нагрузку на организм.
                      </li>
                    </ul>
                  </v-expansion-panel-text>
                </v-expansion-panel>

                <v-expansion-panel>
                  <v-expansion-panel-title>
                    Регулярный сон
                  </v-expansion-panel-title>
                  <v-expansion-panel-text>
                    <ul class="mx-5 my-2">
                      <li class="paragraph">
                        Правильный и регулярный сон играет важную роль в общем
                        здоровье и благополучии. Постарайтесь придерживаться
                        регулярного расписания сна, создавайте комфортные
                        условия для сна. Избегайте яркого освещения, шума и
                        излишней активности перед сном.
                      </li>
                      <li class="paragraph">
                        Рекомендуется не употреблять пищу за 3 часа до сна,
                        чтобы организм имел возможность полноценно отдохнуть, а
                        не заниматься перевариванием пищи.
                      </li>
                      <li class="paragraph">
                        Избегайте чрезмерного потребления кофеина, который может
                        усиливать симптомы ВСД.
                      </li>
                      <li class="paragraph">
                        Оптимальная комнатная температура для сна составляет
                        примерно 18-20 градусов Цельсия.
                      </li>
                      <li class="paragraph">
                        Разработайте ритуал перед сном, который поможет вам
                        расслабиться и подготовиться к сну. Это может быть
                        чтение книги, принятие теплой ванны, медитация.
                      </li>
                    </ul>
                  </v-expansion-panel-text>
                </v-expansion-panel>

                <v-expansion-panel>
                  <v-expansion-panel-title>
                    Правильное питание
                  </v-expansion-panel-title>
                  <v-expansion-panel-text>
                    <ul class="mx-5 my-2">
                      <li class="paragraph">
                        Питайтесь здоровой и сбалансированной пищей. Избегайте
                        чрезмерного употребления кофеина, алкоголя и пищи,
                        богатой сахаром. Регулярное питание с небольшими
                        перекусами может помочь поддерживать уровень сахара в
                        крови стабильным.
                      </li>
                    </ul>
                  </v-expansion-panel-text>
                </v-expansion-panel>

                <v-expansion-panel>
                  <v-expansion-panel-title>
                    Избегайте сильных возбудителей
                  </v-expansion-panel-title>
                  <v-expansion-panel-text>
                    <ul class="mx-5 my-2">
                      <li class="paragraph">
                        Если вы замечаете, что некоторые ситуации или вещи
                        усиливают ваши симптомы, старайтесь избегать их или
                        научитесь справляться c ними.
                      </li>
                      <li class="paragraph">
                        Обратите внимание на факторы, которые усиливают ваши
                        симптомы. Это могут быть физические нагрузки,
                        эмоциональные стрессоры или пищевые продукты, вызывающие
                        негативную реакцию.
                      </li>
                      <li class="paragraph">
                        Если определенные ситуации или люди вызывают у вас
                        дискомфорт, старайтесь устанавливать границы и находить
                        способы справляться с ними, например, учиться эффективно
                        коммуницировать или использовать техники управления
                        стрессом.
                      </li>
                    </ul>
                  </v-expansion-panel-text>
                </v-expansion-panel>

                <v-expansion-panel>
                  <v-expansion-panel-title>
                    Регулярные консультации с врачом
                  </v-expansion-panel-title>
                  <v-expansion-panel-text>
                    <ul class="mx-5 my-2">
                      <li class="paragraph">
                        Важно получить профессиональную медицинскую помощь и
                        советы от врача. Он может рекомендовать дополнительные
                        методы лечения, такие как психотерапия или прописание
                        лекарственных препаратов, в зависимости от вашего
                        конкретного случая.
                      </li>
                      <li class="paragraph">
                        Следуйте рекомендациям врача и регулярно обновляйте свои
                        визиты, чтобы следить за прогрессом и вносить
                        необходимые изменения в лечебный план.
                      </li>
                    </ul>
                  </v-expansion-panel-text>
                </v-expansion-panel>
              </v-expansion-panels>
            </v-expansion-panel-text>
          </v-expansion-panel>
        </v-expansion-panels>
      </v-container>

      <v-divider :thickness="3" />
      <NotificationsInfoComponents />
    </v-main>
    <FooterComponent />
  </v-app>
</template>

<script>
import NotificationsComponents from "./components/NotificationsComponents.vue";
import NotificationsInfoComponents from "./components/NotificationsInfoComponents.vue";
import NavigationBar from "./components/NavigationBar.vue";
import FooterComponent from "./components/FooterComponent.vue";

export default {
  components: {
    NotificationsComponents,
    NotificationsInfoComponents,
    NavigationBar,
    FooterComponent,
  },
};
</script>

<style type="text/css">
.bgimg {
  background-image: url("./assets/bg_home.png");
  background-repeat: repeat;
}
.paragraph {
  font-size: 16px;
  text-align: justify;
}
</style>
